Tekla Open API Reference for Tekla Structures 2025
Identifier Properties
The Identifier type exposes the following members.
Properties
Name | Description
GUID
 The object's globally unique identifier. If the GUID value is set manually, the ID is initialized to 0 and the identification is done based on the GUID.
ID
 The identifier number. If the ID value is set manually, the GUID is initialized to Guid.Empty and the identification is done based on the ID.
ID2
 The sub identifier number. If the subID value is set manually, the GUID is initialized to Guid.Empty and the identification is done based on the ID.
Top
See Also
Reference
Identifier Class
Tekla.Structures Namespace